 * Глобальные сочетания клавиш
** Применение сочетаний

#+BEGIN_SRC emacs-lisp :var keys-table=key-bindings-table exwm-keys-table=exwm-key-bindings-table
(require 'cl-lib)

;; Устанавливает глобальные привязки клавиш из keys-table.
(mapc (lambda (row)
        (cl-destructuring-bind (key func) row
          (global-set-key (kbd key) (intern func))))
      keys-table)

;; Устанавливает глобальные привязки клавиш из exwm-keys-table.
(mapc (lambda (row)
        (cl-destructuring-bind (key func) row
          (global-set-key (kbd key) (intern func))))
      exwm-keys-table)

(require 'exwm)
;; Если запущено в оконной системе и функция exwm-input-set-key доступна, настраивает клавиши EXWM.
(when (and window-system (functionp 'exwm-input-set-key))
  (mapc (lambda (row)
          (cl-destructuring-bind (key func) row
            (exwm-input-set-key (kbd key) (intern func))))
        exwm-keys-table))

(provide 'про-сочетания-клавиш)
#+END_SRC

#+RESULTS:
: про-сочетания-клавиш

